Оголошення: "🎶 Week #2 ( Thu) Lecture #4 - Classes…"
CURSOR. EDUCATION
Створено 07:0407:04
🎶 Week #2 ( Thu)
Lecture #4 - Classes lecture 1    
 Tymofii Khodniev, 7pm
https://us02web.zoom.us/j/82051628451?pwd=TTlqaVlQMFNDN1dHVmU0LzYvVXBXQT09

Meeting ID: 820 5162 8451
Passcode: 376304
Launch Meeting - Zoom
https://us02web.zoom.us/j/82051628451?pwd=TTlqaVlQMFNDN1dHVmU0LzYvVXBXQT09
Завдання: "Lecture #3 - Advanced types "
CURSOR. EDUCATION публікує нове завдання: "Lecture #3 - Advanced types "
Створено 31 січ.31 січ.
Запитання: "Lecture #3 - Advanced types "
CURSOR. EDUCATION публікує нове запитання: "Lecture #3 - Advanced types "
Створено 30 січ.30 січ.
Запитання: "Daily Standup Meeting "
CURSOR. EDUCATION публікує нове запитання: "Daily Standup Meeting "
Створено 30 січ.30 січ.
Оголошення: "🎶 Week #2 ( Mon) Lecture #3 - Advanced…"
CURSOR. EDUCATION
Створено 30 січ.30 січ. (Змінено 31 січ.)
🎶 Week #2 ( Mon)
Lecture #3 - Advanced types    
 Tymofii Khodniev, 7pm
Lecture (record) - https://youtu.be/SsF5YW-a4X8
02ex01-deposits.py
Текст
02ex02-vikings.py
Текст
02_Advanced_Types.pdf
PDF
GMT20230130-165149_Recording.txt
Текст
Lecture #3 - Advanced types Tymofii Khodniev
Відео YouTube   ‪3 години 38 хвилин‬
python_container_types.pdf
PDF
Crash Course - Extract - Variables and Simple Data Types.pdf
PDF
Завдання: "Lecture #2 - Git Intro "
CURSOR. EDUCATION публікує нове завдання: "Lecture #2 - Git Intro "
Створено 26 січ.26 січ. (Змінено 26 січ.)
Запитання: "Lecture #2 - Git Intro "
CURSOR. EDUCATION публікує нове запитання: "Lecture #2 - Git Intro "
Створено 26 січ.26 січ.
Оголошення: "🎶 Week #1 ( Thu) Lecture #2 - Git…"
CURSOR. EDUCATION
Створено 26 січ.26 січ. (Змінено 30 січ.)
🎶 Week #1 ( Thu)
Lecture #2 - Git  Intro   
 Tymofii Khodniev, 7pm
Lecture (record) - https://youtu.be/VqgGrPAKWHQ
Git Intro .pdf
PDF
github-git-cheat-sheet.pdf
PDF
progit_en_v2.1.359.pdf
PDF
progit_ua_v2.1.4-7.pdf
PDF
Lecture #2 - Git Intro Tymofii Khodniev
Відео YouTube   ‪2 години 57 хвилин‬
GMT20230126-165348_Recording.txt
Текст
01_Git_Intro.pdf
PDF
Завдання: "Lecture #1 - Linux Intro "
CURSOR. EDUCATION публікує нове завдання: "Lecture #1 - Linux Intro "
Створено 23 січ.23 січ.
Запитання: "Lecture #1 - Linux Intro "
CURSOR. EDUCATION публікує нове запитання: "Lecture #1 - Linux Intro "
Створено 23 січ.23 січ.
Оголошення: "🎶 Week #1 ( Mon) Lecture #1 - Linux…"
CURSOR. EDUCATION
Створено 23 січ.23 січ. (Змінено 23 січ.)
🎶 Week #1 ( Mon)
Lecture #1 - Linux Intro   
Lubomur Luzhnuу, 7pm 
Lecture (record) - https://youtu.be/bZ7GDPkc9jw
Lecture #1 - Linux Intro Lubomur Luzhnuу - YouTube
https://youtu.be/bZ7GDPkc9jw
GMT20230123-165551_Recording.txt
Текст
Оголошення: "Привіт😎 Що ж, сподіваюсь, уже всі є в…"
CURSOR. EDUCATION
Створено 18 січ.18 січ.
Привіт😎

Що ж, сподіваюсь, уже всі є в чаті у Telegram!  

Бо Вас чекає цікаве творче завдання!)  

Як можна вчитись в групі, якщо не знати її учасників?  
Правильно - ніяк!  
Ми переконані в тому, що групова взаємодія є набагато ефективнішою, ніж робота "сам на сам"!  
(між іншим, з нами погоджуються психологи)  

Тож, Ваше завдання дуже просте: познайомитись один з одним!  
Але, познайомитись у форматі "відео візитки"!  

Кожен та кожна з Вас є в чаті Telegram) 
У цей чат Ви маєте записати відео-меседж/знайомство.

Коротко розповідаєте:

    Хто я?- Звідки?
    Що тут шукаю та яка ціль від навчання?
    Чим можу бути корисним іншим студентам?


(не переживайте за якість і таке інше: можете записати у форматі селфі чи як вам зручно!
коротко і те, що хочете розказати про себе! Хочемо з Вами усіма познайомитись ближче!)  

Знайомимось! Юхууув 🚀
Оголошення: "Soft-Test! Знайомимось ближче <3…"
CURSOR. EDUCATION
Створено 18 січ.18 січ.
Soft-Test! 

Знайомимось ближче <3 
https://forms.gle/FfAxEwPeEirJQzPA6
soft-test Python basic "Red Arrow" group
https://forms.gle/FfAxEwPeEirJQzPA6
Оголошення: "Усім привіт 😇 До основного! Це…"
CURSOR. EDUCATION
Створено 17 січ.17 січ. (Змінено 23 січ.)
Усім привіт 😇

До основного!

Це рекомендовані матеріали, які необхідно передивитись, перечитати до старту:
https://cursoreducation.notion.site/Python-Basic-Recommended-materials-c6f69087dae44ad4a3e64fccc78bf950
Посилання
https://cursoreducation.notion.site/Python-Basic-Recommended-materials-c6f69087dae44ad4a3e64fccc78bf950
02_Flow_Control.html
HTML
01_Introduction.html
HTML
05_Object_Class.html
HTML
03_Functions.html
HTML
04_Datatypes.html
HTML
Оголошення: "Нагадаємо формат навчання. Понеділок…"
CURSOR. EDUCATION
Створено 16 січ.16 січ. (Змінено 16 січ.)
Нагадаємо формат навчання.

Понеділок 19:00 - 21:00
Четвер 19:00 - 21:00
(можливі зміни в днях/форматі/все узгоджуватимемо окремо) 

ℹ️ Записи занять.
Після кожного заняття буде запис.
Пропуск заняття не є критичним, проте май на увазі - це точно буде мати вплив на результат.

🔻 Д/З через методологію Agile-Kanban.
(можеш коротко познайомитись) 
ℹ️ https://dou.ua/lenta/articles/what-is-kanban/
Будемо використовувати сервіс:
https://trello.com
🤓 На реальному прикладі (без доступу до змін)
http://bit.ly/2Bl5EGC

ℹ️ Supports.
У тебе буде сапорт - людина, яка допомагатиме розібратись з тим, що не вдаватиметься, перевірятиме домашні завдання та підтримуватиме у процесі навчання! 

ℹ️ Telegram
У тебе буде телеграм чат з твоєю командою та сапортом! 
там можна буде задавати питання, ділитись успіхом!
 Розвиватись та змінюватись разом з нами :) 

ℹ️ Внутрішня студентська допомога.
Студенти - це рушійна сила навчання.
Безініціативність = смерть еволюції.
Допомагати вирішувати задачі один одному - це добре.
Не допомагати вирішувати задачі одногрупникам - це фу.

ℹ️ Статуси.
В ІТ є такий термін як "standup meeting"
Статуси - це аналог "Standup meeting".
Ви будете їх писати у ваш телеграм канал 1 раз на тиждень (про це ще розкажемо детальніше)

ℹ️ Feedbacks.
Для корегування та гнучкості навчального процесу - нам потрібний постійний та стабільний зворотній зв'язок.
Ви будете заповнювати форму фібеку після кожного заняття:)
Будете ділитись враженнями про заняття)

🤓 Це ядро формату.
Деталей в навчанні багато.
Про інші деталі та інструменти навчання дізнаєтесь в ході навчання 📷
Оголошення: "Привіт, Друзі!) Раді Вас усіх бачити на…"
CURSOR. EDUCATION
Створено 16 січ.16 січ.
Привіт, Друзі!) 
Раді Вас усіх бачити на курсі Python Basic! 

цього тижня онлайн занять ще не буде! 

 Що таке Адаптаційний тиждень та навіщо він нам (та і вам)!?

 Адаптація - то пристосування до нових умов!  
Вас чекає багато нового, незвичного, тяжкого!  
 Тому адаптуватись так важливо)
 Цей тиждень - Адаптаційний. Це наша вилазка та підготовка до роботи на високих швидкостях.
 До речі, в ІТ це називається "Onboarding process".  

 Головні завдання цього тижня:  

    Підготувати Вас психологічно та інтелектуально до проходження курсу.  
    Підготувати середовище (CURSOR) для навчання.

  Ось чим Ви будете займатись цього тижня:  

    Пройдете Soft-Test.
    Вивчите Ринок праці trainee/junior python розробника, також виконаєте деякі задачі на креатив та нетворкінг.
    Повторите в добровільно-примусовому порядку Рекомендовані матеріали.  
    Приєднаєтесь до чату для спілкування, познайомитесь з своїми одногрупниками (матимете конкретні завдання).


  Що ми будемо робити в цей адаптаційний період?

    Донесемо/нагадаємо/пояснимо/перепояснимо Вам процеси в навчанні.
    Вирішимо індивідуальні організаційні питання.
    Донесемо #свідомість CURSOR. Та спробуємо опрацювати деякі "таракани" та "блокери" :)
    Зробимо повторний інструктаж сапортів та викладачів.
    Познайомимо Вас з сапортами.

Також прохання/наказ/молитва/віра до Вас:

    За цей тиждень розгребти всі ваші часові факапи.
    Виставити чіткі пріоритети.
    Розповісти всім друзям, щоб на найближчі місяці вони Вас не кликали пити "пиво")
    Повідомити своє оточення про те, що у Вас починається період, коли доведеться стрибнути вище голови. Тому ви будете раді будь-якій підтримці.

Ми будемо Вас підтримувати, проте ніхто не зробить це краще, аніж рідні Вам люди.
Всім успіхів!
Сподіваємось, Вам сподобається "страждати" разом з нами в "кайф"
І зовсім невдовзі зустрінемось на заняттях!
https://youtu.be/XEfw1oXMmDk
Люди CURSOR.EDUCATION [Документальний фільм]
Відео YouTube   ‪1 година 26 хвилин‬

#!/usr/bin/env python3

"""Calculate deposit percent yield based on time period.

Imagine your friend wants to put money on a deposit.
He has got many offers from different banks:
- First bank declares +A% each day;
- Second bank promises +B% each month;
- Third bank offers +C% by the end of the year;
- The 4th bank promotes +D% in a 10-year term;
- ... and so on ...

Your friend gets a terrible headache calculating all this stuff,
and asks you to help checking everything. You quickly realize
it is a common task and having a simple script is a great idea.

Let's implement this.

A simplified task:
Given the SUM amount of money, and PERCENT yield promised in a
FIXED_PERIOD of time, calculate the TOTAL equivalent of money
in a SET_PERIOD of time.

Math formula:
p = PERCENT / 100
TOTAL = SUM * ((1 + p) ** (SET_PERIOD / FIXED_PERIOD))
"""


# TODO: add lines to calculate yields for some common periods
#       of time (e.g. 1 month, 1 year, 5 years, 10 years)
# TODO: change the script to output the 1-year percent yield
#       as well
# TODO: (extra) Output only percents if the initial SUM is
#       not known at the moment the script is run


USAGE = """USAGE: {script} initial_sum percent fixed_period set_period

\tCalculate deposit yield. See script source for more details.
"""
USAGE = USAGE.strip()


def deposit(initial_sum, percent, fixed_period, set_period):
    """Calculate deposit yield."""
    per = percent / 100
    growth = (1 + per) ** (set_period / fixed_period)
    return initial_sum * growth


def main(args):
    """Gets called when run as a script."""
    if len(args) != 4 + 1:
        exit(USAGE.format(script=args[0]))

    args = args[1:]
    initial_sum, percent, fixed_period, set_period = map(float, args)

    # same as
    # initial_sum = float(args[0])
    # percent = float(args[1])
    # ...

    res = deposit(initial_sum, percent, fixed_period, set_period)
    print(res)


if __name__ == '__main__':
    import sys

    main(sys.argv)

